import { Component } from '@angular/core';
import { RouterOutlet } from '@angular/router';

@Component({
  selector: 'app-root',
  imports: [RouterOutlet],
  templateUrl: './app.component.html',
  styleUrl: './app.component.css'
})
export class AppComponent {
  title = 'fternismatologio';

  fternismatologio = [
    'ΕΙΝΑΙ ΕΓΩΙΣΤΗΣ',
    'ΤΡΕΛΗ ΑΓΑΠΗ',
    'ΤΗΛΕΦΩΝΙΚΗ ΕΙΔΗΣΗ',
    'ΟΡΜΗΤΙΚΗ ΝΥΧΤΑ',
    'ΦΑΣΑΡΙΑ ΣΤΟ ΣΠΙΤΙ',
    'ΑΥΤΟ ΠΟΥ ΛΑΧΤΑΡΑΣ ΘΑ ΓΙΝΕΙ',
    'ΒΡΑΔΙΝΟΣ ΠΕΡΙΠΑΤΟΣ',
    'ΜΕΤΑ ΑΠΟ ΑΠΟΤΥΧΙΑ, ΓΑΛΗΝΗ',
    'ΜΗΝ ΕΙΣΑΙ ΣΚΛΗΡΟΚΑΡΔΟΣ/Η',
    'Ο/Η ΚΑΛΥΤΕΡΟΣ/Η ΣΟΥ ΦΙΛΟΣ/Η ΔΕ ΣΕ ΚΑΤΑΛΑΒΑΙΝΕΙ',
    'ΣΕ ΘΑΥΜΑΖΕΙ ΚΑΙ ΣΕ ΠΡΟΣΤΑΤΕΥΕΙ',
    'ΑΡΡΩΣΤΙΑ',
    'ΕΥΧΑΡΙΣΤΗ ΕΙΔΗΣΗ',
    'Σ\'ΑΓΑΠΑΕΙ ΠΟΛΥ',
    'ΕΧΕΙΣ ΕΝΑΝ ΚΑΛΟ ΦΙΛΟ',
    'ΣΟΥ ΕΙΝΑΙ ΠΙΣΤΟΣ',
    'ΧΑΡΟΥΜΕΝΟ Σ/Κ',
    'ΣΕ ΕΠΙΘΥΜΕΙ ΚΑΙ ΣΕ ΘΕΛΕΙ ΠΟΛΥ',
    'ΑΡΕΣΕΙΣ ΣΕ ΕΝΑΝ ΞΑΝΘΟ',
    'ΘΑ ΛΑΒΕΙΣ ΓΡΑΜΜΑ',
    'ΠΑΡΕ ΜΕΤΡΑ, ΣΕ ΖΗΛΕΥΟΥΝ',
    'ΕΝΑ ΜΕΛΑΧΡΙΝΟ ΑΓΟΡΙ ΣΕ ΘΕΛΕΙ',
    'ΦΙΛΙ',
    'ΚΑΠΟΙΟΣ/Α ΑΣΧΟΛΕΙΤΑΙ ΜΑΖΙ ΣΟΥ',
    'ΘΑ ΠΑΡΕΙΣ ΔΩΡΟ',
    'ΤΟ ΑΓΟΡΙ ΣΟΥ ΥΠΟΦΕΡΕΙ',
    'ΕΡΩΤΙΚΗ ΕΞΟΜΟΛΟΓΗΣΗ',
    'ΘΑ ΕΧΕΙΣ ΦΑΣΑΡΙΑ',
    'ΘΑ ΧΟΡΕΨΕΤΕ',
    'ΘΑ Σ\'ΕΓΚΑΤΑΛΕΙΨΕΙ',
    'ΣΕ ΣΚΕΦΤΕΤΑΙ ΣΥΝΕΧΕΙΑ',
    'ΘΑ ΣΕ 
    ',
    'ΘΑ ΓΝΩΡΙΣΕΙΣ ΘΑΥΜΑΣΤΕΣ/ΣΤΡΙΕΣ',
    'ΜΙΑ ΕΚΠΛΗΞΗ ΣΕ ΠΕΡΙΜΕΝΕΙ',
    'ΕΠΙΣΤΡΕΦΕΙ ΜΕ ΣΥΓΓΝΩΜΗ',
    'ΣΕ ΟΝΕΙΡΕΥΕΤΑΙ',
    'ΣΕ ΖΗΤΑΕΙ ΑΠΕΛΠΙΣΜΕΝΑ',
    'ΣΥΜΠΤΩΣΗ',
    'ΕΝΑ ΑΓΟΡΙ ΠΙΣΤΟ',
    'ΤΥΧΗ ΑΥΡΙΟ',
    'Σ\'ΑΓΑΠΑΕΙ',
    'ΔΩΡΟ ΑΠΟ ΑΓΑΠΗΜΕΝΟ ΠΡΟΣΩΠΟ',
    'ΑΠΙΣΤΙΑ',
    'ΘΑ ΕΡΩΤΕΥΤΕΙΣ',
    'ΑΣΧΗΜΗ ΜΕΡΑ',
    'ΖΗΛΙΑ',
    'ΑΝΑΜΕΣΑ ΣΕ ΔΥΟ ΑΓΟΡΙΑ',
    'ΞΑΦΝΙΚΑ ΘΑ ΜΠΕΙ ΚΑΠΟΙΟΣ/Α ΣΤΗ ΖΩΗ ΣΟΥ'
  ]


  getFternismatologio(){

    
    return this.fternismatologio[this.getTimeSlotIndex()]

  }


  getTimeSlotIndex(): number {
    const now = new Date();
    const hours = now.getHours();
    const minutes = now.getMinutes();
    const slotIndex = Math.floor(minutes / 30); // 0 
    const index = hours * 2 + slotIndex;
    return index;
  }

}
